
## :x: Apply Failed

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21111447258)



<pre><code>Error: Attempt to index null value

  on provider.tf line 41, in provider &#34;argocd&#34;:
  41:   password = data.kubernetes_secret_v1.argo_cluser_password.data[&#34;password&#34;]

This value is null, so it does not have any indices.

Error: add label selector target: load balancer is not attached to a network (load_balancer_not_attached_to_network, 420d98f3aeead2890bc96519e4e16ecc)

  with hcloud_load_balancer_target.this,
  on servers.tf line 33, in resource &#34;hcloud_load_balancer_target&#34; &#34;this&#34;:
  33: resource &#34;hcloud_load_balancer_target&#34; &#34;this&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.talos.tls_private_key.ssh_key[0]: Refreshing state... [id=6b8ac8faa57f153ccbac22e6b7d75397c3b3c411]
module.talos.talos_machine_secrets.this: Refreshing state... [id=machine_secrets]
module.talos.data.hcloud_datacenter.this: Reading...
module.talos.hcloud_network.this: Refreshing state... [id=11848573]
module.talos.hcloud_placement_group.worker: Refreshing state... [id=1398030]
module.talos.data.hcloud_image.x86[0]: Reading...
module.talos.hcloud_placement_group.control_plane: Refreshing state... [id=1398029]
data.cloudflare_zone.this: Reading...
module.talos.hcloud_firewall.this[0]: Refreshing state... [id=10412163]
module.talos.hcloud_ssh_key.this: Refreshing state... [id=105840801]
data.cloudflare_zone.this: Read complete after 1s [id=aff336ce5012d1e29eb613ba0ec54d9a]
data.google_secret_manager_secret_version.argocd_app_pem_key: Reading...
module.talos.data.hcloud_image.x86[0]: Read complete after 1s
module.talos.data.hcloud_datacenter.this: Read complete after 1s [name=hel1-dc2]
module.talos.hcloud_primary_ip.control_plane_ipv4[0]: Refreshing state... [id=113935357]
module.talos.data.hcloud_location.this: Reading...
module.talos.data.hcloud_location.this: Read complete after 0s [name=hel1]
module.talos.hcloud_network_subnet.nodes: Refreshing state... [id=11848573-10.0.1.0/24]
data.google_secret_manager_secret_version.argocd_app_pem_key: Read complete after 0s [id=projects/671067631752/secrets/argocd-gh-app-pem-key/versions/1]
module.talos.data.talos_client_configuration.this: Reading...
module.talos.data.talos_client_configuration.this: Read complete after 0s [id=prod.malachowski.me]
module.talos.data.talos_machine_configuration.control_plane["control-plane-1"]: Reading...
module.talos.data.talos_machine_configuration.control_plane["control-plane-1"]: Read complete after 0s [id=prod.malachowski.me]
module.talos.hcloud_server.control_planes["control-plane-1"]: Refreshing state... [id=117738718]
module.talos.talos_machine_bootstrap.this[0]: Refreshing state... [id=machine_bootstrap]
module.talos.talos_cluster_kubeconfig.this[0]: Refreshing state... [id=prod.malachowski.me]
module.talos.data.http.talos_health[0]: Reading...
module.talos.data.helm_template.hcloud_ccm: Reading...
module.talos.data.helm_template.cilium_default[0]: Reading...
module.talos.data.http.talos_health[0]: Read complete after 1s [id=https://157.180.83.46:6443/version]
module.talos.data.helm_template.hcloud_ccm: Read complete after 0s [id=hcloud-cloud-controller-manager]
module.talos.data.kubectl_file_documents.hcloud_ccm: Reading...
module.talos.data.kubectl_file_documents.hcloud_ccm: Read complete after 0s [id=5e9f93b41bae4fbb3c259f0ea2d6eee28a43bc4ce092d8ba7211c9ffee8ff48d]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/system:hcloud-cloud-controller-manager:restricted]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager"]: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/hcloud-cloud-controller-manager]
module.talos.kubectl_manifest.apply_hcloud_ccm["/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager"]: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/hcloud-cloud-controller-manager]
module.talos.kubectl_manifest.apply_hcloud_ccm["/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/system:hcloud-cloud-controller-manager]
module.talos.data.helm_template.cilium_default[0]: Read complete after 0s [id=cilium]
module.talos.data.kubectl_file_documents.cilium[0]: Reading...
module.talos.data.kubectl_file_documents.cilium[0]: Read complete after 0s [id=c59f2d610804ad1ab424358ff3a06838e7d94e803d0aa990046d71655b9b5ff0]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/services/cilium-envoy"]: Refreshing state... [id=/api/v1/namespaces/kube-system/services/cilium-envoy]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator"]: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/deployments/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-config"]: Refreshing state... [id=/api/v1/namespaces/kube-system/configmaps/cilium-config]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy"]: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/daemonsets/cilium-envoy]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cilium-config-agent]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cilium-config-agent]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator"]: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium-operator]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cilium]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy"]: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium-envoy]
module.talos.kubectl_manifest.apply_cilium["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cilium]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/serviceaccounts/cilium"]: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/cilium]
module.talos.kubectl_manifest.apply_cilium["/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config"]: Refreshing state... [id=/api/v1/namespaces/kube-system/configmaps/cilium-envoy-config]
module.talos.kubectl_manifest.apply_cilium["/apis/apps/v1/namespaces/kube-system/daemonsets/cilium"]: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/daemonsets/cilium]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.kubernetes_secret_v1.argo_cluser_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret_v1" "argo_cluser_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # argocd_application.cluster_config will be created
  + resource "argocd_application" "cluster_config" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-config"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "clusters/prod.malachowski.me"
              + repo_url        = "https://github.com/malachowski-labs/manifests"
              + target_revision = "HEAD"

              + directory {
                  + recurse = true
                }
            }

          + sync_policy {
              + sync_options = [
                  + "ServerSideApply=true",
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # argocd_application.traefik will be created
  + resource "argocd_application" "traefik" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-traefik-chart"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "traefik"
              + repo_url        = "https://github.com/traefik/traefik-helm-chart.git"
              + target_revision = "v38.0.2"

              + helm {
                  + values = <<-EOT
                        logs:
                                    general:
                                      level: INFO
                                    access:
                                      enabled: true
                                  service:
                                    annotations:
                                      load-balancer.hetzner.cloud/location: hel1
                                      load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # cloudflare_dns_record.this will be created
  + resource "cloudflare_dns_record" "this" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # cloudflare_dns_record.wildcard will be created
  + resource "cloudflare_dns_record" "wildcard" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "*.malachowski.me"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "A"
      + zone_id          = "aff336ce5012d1e29eb613ba0ec54d9a"
    }

  # hcloud_load_balancer.this will be created
  + resource "hcloud_load_balancer" "this" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = (known after apply)
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "prod-malachowski-me-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm (known after apply)

      + target (known after apply)
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "7.7.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_secret_v1.argocd_repo_access will be created
  + resource "kubernetes_secret_v1" "argocd_repo_access" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "repo-creds"
            }
          + name             = "argo-private-repo-secret"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.talos.hcloud_server.control_planes["control-plane-1"] will be updated in-place
  ~ resource "hcloud_server" "control_planes" {
        id                         = "117738718"
        name                       = "control-plane-1"
        # (20 unchanged attributes hidden)

      - network {
          - alias_ips   = [
              - "10.0.1.100",
            ] -> null
          - ip          = "10.0.1.101" -> null
          - mac_address = "86:00:00:82:6d:43" -> null
          - network_id  = 11848573 -> null
        }
      + network {
          + alias_ips   = []
          + ip          = "10.0.1.101"
          + mac_address = (known after apply)
          + network_id  = 11848573
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.
hcloud_load_balancer.this: Creating...
module.talos.hcloud_server.control_planes["control-plane-1"]: Modifying... [id=117738718]
hcloud_load_balancer.this: Creation complete after 1s [id=5553541]
hcloud_load_balancer_target.this: Creating...
cloudflare_dns_record.wildcard: Creating...
cloudflare_dns_record.this: Creating...
cloudflare_dns_record.wildcard: Creation complete after 0s [id=6707a232ac4a1defeee047a225af46d2]
cloudflare_dns_record.this: Creation complete after 0s [id=128ef556dbf71ed471945e310a2d4965]
module.talos.hcloud_server.control_planes["control-plane-1"]: Still modifying... [id=117738718, 10s elapsed]
module.talos.hcloud_server.control_planes["control-plane-1"]: Modifications complete after 17s [id=117738718]
helm_release.argocd: Creating...
helm_release.argocd: Still creating... [10s elapsed]
helm_release.argocd: Still creating... [20s elapsed]
helm_release.argocd: Still creating... [30s elapsed]
helm_release.argocd: Still creating... [40s elapsed]
helm_release.argocd: Still creating... [50s elapsed]
helm_release.argocd: Still creating... [1m0s elapsed]
helm_release.argocd: Still creating... [1m10s elapsed]
helm_release.argocd: Still creating... [1m20s elapsed]
helm_release.argocd: Still creating... [1m30s elapsed]
helm_release.argocd: Creation complete after 1m35s [id=argocd]
data.kubernetes_secret_v1.argo_cluser_password: Reading...
kubernetes_secret_v1.argocd_repo_access: Creating...
data.kubernetes_secret_v1.argo_cluser_password: Read complete after 0s [id=argocd/argo-initial-admin-secret]
kubernetes_secret_v1.argocd_repo_access: Creation complete after 1s [id=default/argo-private-repo-secret]

Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and 2 more similar warnings elsewhere)

Error: Attempt to index null value

  on provider.tf line 41, in provider "argocd":
  41:   password = data.kubernetes_secret_v1.argo_cluser_password.data["password"]

This value is null, so it does not have any indices.

Error: add label selector target: load balancer is not attached to a network (load_balancer_not_attached_to_network, 420d98f3aeead2890bc96519e4e16ecc)

  with hcloud_load_balancer_target.this,
  on servers.tf line 33, in resource "hcloud_load_balancer_target" "this":
  33: resource "hcloud_load_balancer_target" "this" {

::error::OpenTofu exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"infra-apply","PRNumber":11,"Program":"tfcmt","SHA1":"e848480ef2df1055160e42ddd6c990077c297dde","Vars":{},"WorkflowName":"infra-apply"} -->